References/ASTT/XMLFile1.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetNTP>
      <tds:FromDHCP>false</tds:FromDHCP>
      <tds:NTPManual>
        <tt:Type>IPv4</tt:Type>
        <tt:IPv4Address>10.1.1.1</tt:IPv4Address>
        <tt:DNSname>test#$%</tt:DNSname>
      </tds:NTPManual>
    </tds:SetNTP>
  </soap:Body>
</soap:Envelope>

